# MepAnalyticalCriticalpathParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepAnalyticalCriticalpathParam Property
ParameterTypeId Class See Also
---
"Critical Path"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepAnalyticalCriticalpathParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepAnalyticalCriticalpathParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepAnalyticalCriticalpathParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace